<a href="https://colab.research.google.com/github/ilham-mukti/Machine-Learning/blob/main/clustering/DBSCAN_latihan_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [30]:
import pandas as pd
from sklearn.cluster import DBSCAN
from sklearn.metrics import silhouette_score

In [2]:
datas = pd.read_csv("https://github.com/krishnaik06/DBSCAN-Algorithm/raw/master/Mall_Customers.csv")
datas.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [14]:
X = datas.iloc[:, 3:5]
X.head()

   Annual Income (k$)  Spending Score (1-100)
0                  15                      39
1                  15                      81
2                  16                       6
3                  16                      77
4                  17                      40

In [40]:
dbscan = DBSCAN(eps=7, min_samples=4)
labels = dbscan.fit_predict(X)
labels

array([-1,  0,  1,  0,  2,  0,  1, -1,  1,  0, -1, -1, -1,  0, -1,  0,  2,
        0,  2, -1,  2,  0,  1,  0, -1, -1,  2, -1,  2, -1, -1,  0, -1, -1,
       -1, -1, -1,  0, -1, -1,  3, -1,  3,  3, -1,  3,  3,  3,  3,  3,  3,
        3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,
        3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,
        3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,
        3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,
        3,  3,  3,  3,  4,  3,  4,  3,  4,  5,  4,  5,  4,  3,  4,  5,  4,
        5,  4,  5,  4,  5,  4,  3,  4,  5,  4,  3,  4,  5,  4,  5,  4,  5,
        4,  5,  4,  5,  4,  5,  4,  3,  4,  5,  4, -1,  7,  6,  4, -1,  7,
        6,  7,  6,  4,  6,  4,  6,  7,  6,  4, -1,  4,  6,  4, -1, -1, -1,
       -1, -1,  4, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1])

In [41]:
X['labels'] = labels
X.head()

   Annual Income (k$)  Spending Score (1-100)  labels
0                  15                      39      -1
1                  15                      81       0
2                  16                       6       1
3                  16                      77       0
4                  17                      40       2

In [42]:
X.labels.value_counts()

 3    87
-1    39
 4    28
 5    14
 0    11
 6     7
 2     6
 1     4
 7     4
Name: labels, dtype: int64

In [43]:
silhouette_score(X, labels)

0.22432472468405468